Revit 2027 API
BuiltInFailures.ElectricalFailures.FamilyMismatchCircuit Property
 The family no longer matches the properties for the Circuit. Disconnect the family from the Circuit?
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId FamilyMismatchCircuit { get; }
Public Shared ReadOnly Property FamilyMismatchCircuit As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ FamilyMismatchCircuit {
	FailureDefinitionId^ get ();
}
static member FamilyMismatchCircuit : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.ElectricalFailures Class
Autodesk.Revit.DB Namespace